Repository: Marwan63Yasser/MCC-RGB-Co
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Contact Us
ar: تواصل معنا

source: Main
ar: الرئيسية

source: About
ar: عن الشركة

source: Our Clients
ar: عملائنا

source: Portfolio
ar: أعمالنا

source: Our Services
ar: خدماتنا

source: Specialists in Contracting
ar: متخصصون فى المقاولات

# MCC
source: Modern Construction Company for General Contracting
ar: شركة البناء الحديث للمقاولات العامة

# MCC_Desc
source: One of the leading companies in modern contracting and construction works in the Kingdom of Saudi Arabia
ar: إحدى الشركات الرائدة فى أعمال المقاولات والبناء الحديث في المملكة العربية السعودية

source: Read more..
ar: اقرأ المزيد..

source: who are we?
ar: من نحن؟

# WhoAreWeDesc
source: We are a company specialized in the field of contracting, real estate development, and building villas, buildings, residential and non-residential complexes, schools, etc., and we work with the finest materials and the most advanced tools.
ar: نحن شركة متخصصة في مجال المقاولات والتطوير العقاري وبناء الڤيلل والعمائر والمجمعات السكنية والغير سكنية والمدارس وغيرها، ونعمل بأجود الخامات وبأكثر الأدوات تطوراً.

# WhoAreWeS1
source: The Modern Construction Company for General Contracting was established at the beginning of the millennium, and its headquarters are located in Dammam, Saudi Arabia. It also has representatives in several other cities, such as Riyadh, Jeddah, and others.
ar: تأسست شركة البناء الحديث للمقاولات العامة مع بداية الالفية ويقع المقر الرئيسي لها بمدينة الدمام بالسعودية كما ولها ممثلين بعدة مدن اخرى مثل الرياض وجدة وغيرها.

# WhoAreWeS2
source: The company uses most internal resources, giving it a high degree of control over project quality and timely delivery.
ar: تستخدم الشركة معظم الموارد الداخلية مما يمنحها درجة عالية من التحكم في جودة المشاريع والتسليم فى الوقت المناسب.

# WhoAreWeS3
source: The company has grown and developed over the past years to become one of the leading construction companies in implementing turnkey projects.
ar: نمت الشركة وتطورت على مدار السنوات الماضية لتصبح من شركات الانشاءات الرائدة في تنفيذ المشاريع الخاصة بنظام تسليم المفتاح.

# WhoAreWeS4
source: The company offers prominent construction projects in various residential, commercial, educational and industrial sectors.
ar: تقدم الشركة مشاريع بناء بارزة في القطاعات المختلفة السكنية والتجارية والتعليمية والصناعية.

# WhoAreWeS5
source: The company seeks to become a major player in the construction industry in the Kingdom of Saudi Arabia through its commitment to reliability, in-house capabilities.
ar: تسعى الشركة لتصبح لاعبا رئيسيا في صناعة البناء في المملكة العربية السعودية من خلال التزامها بالموثوقية والقدرات الداخلية وتفاني العمال والالتزام بقواعد الصحة والسلامة.

# WhoAreWeS6
source: The company seeks to provide the best value to its customers by benefiting from its experience extending for more than twenty years in the field of contracting in the Kingdom.
ar: تسعى الشركة لتقديم افضل قيمة لعملائها من خلال الاستفادة من خبراتها الممتدة لأكثر من عشرين عاما في مجال المقاولات بالمملكة.

source: Vision and Values
ar: الرؤية والقيم

source: How do we work
ar: كيف نعمل

source: What sets us apart
ar: ما يميزنا

# WhatSetsUsApartDesc
source: We have an engineering team specialized in the field and equipped with the latest tools and the best materials.
ar: لدينا فريق هندسي متخصص في المجال ومجهز بأحدث الأدوات وأفضل الخامات

# Apart1
source: Experience
ar: الخبرة

# Apart2
source: Quality
ar: الجودة

# Apart3
source: Price
ar: السعر

# Apart4
source: Mastery
ar: الإتقان

# Apart1Desc
source: We have high experience over many years in constructing facilities of all types.
ar: نتمتع بخبرة عالية على مدار العديد من السنوات في إنشاء المنشآت بكافة أنواعها

# Apart2Desc
source: We use the finest materials and materials during construction
ar: نستخدم أجود أنواع المواد والخامات أثناء الإنشاء

# Apart3Desc
source: We offer our customers competitive prices and lower costs, while ensuring that the service is provided with high efficiency
ar: نقدم لعملائنا أسعاراً تنافسية وتكلفة أقل، مع ضمان تقديم الخدمة بكفاءة عالية

# Apart4Desc
source: When implementing the project, we take into account precision and mastery under the supervision of technicians and specialists
ar: نراعي عند تنفيذ المشروع الدقة والإتقان تحت إشراف فنين و متخصصين

source: View Services
ar: عرض الخدمات

# PortfolioDesc
source: Modern Construction Company provides its services for all types of construction projects, such as residential, commercial, and others.
ar: تقدم شركة البناء الحديث خدماتها لجميع المشاريع الانشائية بأنواعها المختلفة مثل السكنية والتجارية وغيرها.

source: View all works
ar: عرض جميع الاعمال

# OurClients2
source: The Clients
ar: العملاء

# ClientsDesc
source: Success Partners, always happy to serve you
ar: شركاء النجاح، سعداء دوماً بخدمتكم

source: View all Partners
ar: عرض جميع الشركاء

source: Name
ar: الاسم

source: Phone
ar: الجوال

source: Email
ar: البريد الإلكتروني

source: Service
ar: الخدمة

source: Message
ar: الرسالة

source: Submit
ar: إرسال

# Service1
source: Building Construction
ar: إنشاء المباني وصيانتها

# Service1Desc
source: The Modern Construction Company for General Contracting carries out all contracting works in terms of constructing and maintaining buildings, such as residential real estate and private companies, and the construction of schools, hospitals, commercial centers and malls, in addition to villas, palaces, houses, etc. The organization is distinguished by providing a large number of workers specialized in various construction works and their requirements, such as Plumbing, carpentry, blacksmithing, sanitation, and others, in coordination with the best professional engineers, in addition to consultants in the engineering, construction, and architectural fields, while providing all the necessary building materials and necessary tools for the work.
ar: تقوم شركة البناء الحديث للمقاولات العامة بكافة أعمال المقاولات من حيث إنشاء وصيانة المباني، مثل العقارات السكنية والشركات الخاصة، وتشييد المدارس والمستشفيات والمراكز التجارية والمولات، بالإضافة للڤيلل والقصور والبيوت وغيرها، وتتميز المؤسسة بتوفير عدد كبير من العمالة المتخصصة في أعمال البناء المختلفة ومتطلباتها، مثل السباكة والنجارة والحدادة والصرف الصحي وغيرها بالتنسيق مع أفضل المهندسين المحترفين، بالإضافة إلى الاستشاريين في المجال الهندسي والإنشائي والمعماري مع توفير كافة مواد البناء اللازمة والأدوات الضرورية للعمل.

# Service2
source: Electro-mechanical works
ar: أعمال الالكتروميكانيكال

# Service2Desc
source: Implementing electrical work with quality and innovation in design and installation, from the moment the building or facility is constructed, by installing electrical pipes and using good-quality wires that are proportionate to the expected electrical loads, and then delivering electricity to the main control units located in all units of the building, as well as making the necessary connections for lighting and implementing Communications network, surveillance cameras, fire alarm network, central television, audio radio, and other systems, and this is done in accordance with the client’s wishes and in accordance with standard specifications.
ar: تنفيذ أعمال الكهرباء بجودة وابتكار في التصميم والتركيب، منذ لحظة تشييد المبنى أو المنشأة بتركيب المواسير الكهربائية واستخدام أسلاك ذات نوعية جيدة ومتناسبة مع الأحمال الكهربائية المتوقعة، ومن ثم إيصال الكهرباء إلى وحدات التحكم الرئيسية الموجودة في كل وحدات المبنى، وكذلك عمل التوصيلات اللازمة للإنارة وتنفيذ شبكة للاتصالات وكاميرات المراقبة وشبكة إنذار الحرائق والتلفزيون المركزي والإذاعة الصوتية وغيرها من الأنظمة، ويتم ذلك وفقاً لرغبات العميل وطبقاً للمواصفات القياسية

# Service3
source: Real estate development
ar: التطوير العقاري

# Service3Desc
source: Which includes the process of providing the necessary financing, developing ideas, feasibility studies, marketing, accurate knowledge of the market, owning land and building on it, transforming modern ideas and visions into tangible reality, and ultimately coming up with successful real estate units that suit the needs of society, especially youth, and benefit the nation and society.
ar: والذي يشمل علي عملية توفير التمويل اللازم ووضع الأفكار ودراسة الجدوى والتسويق والمعرفة الدقيقة بالسوق وامتلاك الأراضي والبناء عليها، وتحويل الأفكار والرؤى الحديثة إلى واقع ملموس والخروج في النهاية بوحدات عقارية ناجحة تتناسب مع احتياجات المجتمع وخاصة الشباب، وتعود بالنفع على الوطن والمجتمع.

# Service4
source: Metal Works
ar: الأعمال المعدنية

# Service4Desc
source: Construction of steel buildings such as hangars, warehouses and office buildings in Dammam and Jubail Industrial City is under the supervision of the Royal Commission and we have good experience in this field, and the civil and infrastructure works that these buildings need are being carried out.
ar: بناء المباني الحديدية مثل الهناجر والمستودعات والمباني المكتبية في الدمام ومدينة الجبيل الصناعية تحت إشراف الهيئة الملكية ولدينا خبرة جيدة في هذا المجال، ويتم تنفيذ ما تحتاجه هذه المباني من أعمال مدنية وبنية تحتية.

source: See More
ar: تعرف على المزيد

# WorkType1
source: Residential
ar: سكني

# WorkType2
source: Commercial
ar: تجاري

# Work1
source: Modern construction Villas
ar: ڤيلل البناء الحديث

# Work1Desc
source: It consists of 10 turnkey private residential villas with a total area of 3,600 m2
ar: يتكون من 10 ڤيلل سكنية خاصة بنظام تسليم المفتاح بإجمالي مساحة 3,600 م2

# Work2
source: Two commercial towers
ar: برجين تجاريين

# Work2Desc
source: Two commercial towers in the Al-Atheer district in Dammam, with a total area of 16,940 square meters, each with a height of 10 floors.
ar: برجين تجاريين بحي الأثير بالدمام ويبلغ مجموع مساحتهما 16,940 م2 بارتفاع 10 طوابق لكل منهما

# Work3
source: Al-Fakhiriya villa complex
ar: مجمع ڤيلل الفاخرية

# Work3Desc
source: This complex consists of 30 connected and separate villas with a total area of 14,800 square meters.
ar: يتكون هذا المجمع من 30 ڤيلا متصلة ومنفصلة بمساحات اجمالية 14,800 م2

# Work4
source: Residential Building
ar: عمارة سكنية

# Work4Desc
source: The building consists of 8 residential apartments on a turnkey system, and the total area of ​​the apartments is 1,700 square meters.
ar: تتكون العمارة من 8 شقق سكنية بنظام تسليم المفتاح ويبلغ مجموع مساحة الشقق 1,700 م2

# Client1
source: One of the largest energy and petroleum companies in the world
ar: إحدى أكبر شركات الطاقة والبترول في العالم

# Client2
source: The Ministry Responsible for Urban Planning of the Kingdom's Cities
ar: الوزارة المسؤولة عن التخطيط العمراني لمدن المملكة

# Client3
source: Saudi Basic Industries Corporation
ar: الشركة السعودية للصناعات الأساسية والبتروكيماوية

# Client4
source: One of the largest multi-disciplinary companies in Saudi Arabia
ar: واحدة من أكبر الشركات متعددة المجالات في السعودية

# Client5
source: US National Fire Protection Agency
ar: الهيئة الوطنية الامريكية للحماية من الحرائق

# AboutDesc
source: Our vision, our values and how we work
ar: رؤيتنا وقيمنا وكيفية عملنا

# howDoWeWorkDesc
source: Modern Construction Company for General Contracting has an enviable reputation for meeting deadlines and successfully delivering projects, and we look forward to always maintaining that and what has been achieved over years of hard and dedicated work.
ar: تتمتع شركة البناء الحديث للمقاولات العامة بسمعة تحسد عليها في الوفاء بالمواعيد النهائية وتسليم المشاريع بنجاح، ونتطلع للحفاظ على ذلك دائماً وعلى ما تم تحقيقه على مدار سنوات من العمل الجاد والمتفاني.

# Vision1
source: The Quality:
ar: الجودة:

# Vision1Desc
source: Our primary responsibility is to implement construction projects according to client requirements while complying with building regulations and we are committed to providing our clients with the highest standards of quality and safety.
ar: مسئوليتنا الأساسية هي تنفيذ مشاريع البناء وفقاً لمتطلبات العميل مع الامتثال لأنظمة البناء وملتزمون بتزويد عملاءنا بأعلى معايير الجودة والأمان

# Vision2
source: The Delivery:
ar: التسليم:

# Vision2Desc
source: We are fully aware that on-time project delivery is a fundamental requirement for all our clients.
ar: نحن ندرك تماماً أن التسليم في الوقت المحدد للمشروع هو مطلب أساسي لجميع عملائنا.

# Value1
source: Vision:
ar: الرؤية:

# Value1Desc
source: Delivering all our projects while adhering to all clients’ needs and exceeding their expectations through the application of advanced technologies and systems.
ar: تسليم جميع مشاريعنا مع الالتزام بجميع احتياجات العملاء بما يتجاوز توقعاتهم من خلال تطبيق التقنيات والأنظمة المتطورة.

# Value2
source: Our culture:
ar: ثقافتنا:

# Value2Desc
source: Our work culture is embodied in a number of principles and values, which include promoting a professional and ethical work environment, recognizing the value of continuous improvement, openness, listening to customers, and adapting to change.
ar: تتجسد ثقافة العمل لدينا في عدد من المبادئ والقيم والتي تتمثل في تعزيز بيئة عمل مهنية وأخلاقية، والتعرف على قيمة التحسين المستمر والانفتاح والاستماع الى العملاء والتكيف مع التغيير.

# Value3
source: Our Values:
ar: قيمنا:

# Value3Desc
source: Continuous improvement, innovation, excellence, quality assurance, security and safety. We believe in the necessity of achieving these values and standards to maintain excellent service to all customers.
ar: التحسين المستمر والابتكار والتميز وضمان الجودة والأمان والسلامة، نؤمن بضرورة تحقيق هذه القيم والمعايير للحفاظ على تقديم خدمة ممتازة لجميع العملاء.

# Value4
source: Transparency:
ar: الشفافية:

# Value4Desc
source: Achieving complete transparency is essential in everything we do in the company, in order to enhance trust and achieve our desired goal, which is 100% customer satisfaction and implementing everything that was agreed upon with the customer.
ar: تحقيق الشفافية الكاملة هو شيء أساسي في كل ما نقوم به في الشركة، من أجل تعزيز الثقة وتحقيق هدفنا المنشود وهو إرضاء العميل بنسبة ١٠٠٪ وتنفيذ كل ما تم الاتفاق عليه مع العميل.

source: Service Details
ar: تفاصيل الخدمة

source: Service Request
ar: طلب الخدمة

# ContactUsDesc
source: Please feel free to get in touch through any of our channels listed below.
ar: إذا كنت ترغب في الاتصال بنا مباشرة، فلا تتردد في الاتصال من خلال أي من قنواتنا المذكورة أدناه

# MainBranch
source: Main branch in Dammam:
ar: الفرع الرئيسي بالدمام:

# MailBox
source: Mail Box: 8475
ar: صندوق بريد: 8475

# PostalCode
source: Postal Code: 34263
ar: الرمز البريدى: 34263

# Address
source: Al-Shu'la Neighborhood - Zuhair Bin Qais Street
ar: حي الشعلة - شارع زهير بن قيس

# AddressPhone
source: Al-Shu'la Neighborhood - Zuhair Bin Qais Street
ar: حي الشعلة - شارع زهير بن قيس

# WeHappy
source: We are happy to serve you
ar: نسعد بخدمتكم

source: From
ar: من

source: To
ar: إلى

source: Sunday
ar: الأحد

source: Thursday
ar: الخميس

# FromHour
source: From
ar: من الساعة

# Hour8Am
source: 8:00 AM
ar: 8:00 ص

# Hour5Pm
source: 5:00 PM
ar: 5:00 م

source: Social Links
ar: وسائل التواصل

# ShortLinks
source: Site Map
ar: روابط مختصرة

source: None
ar: بدون خدمة

# CopyRights
source: All rights reserved. RGB Co. @2024
ar: جميع الحقوق محفوظة . شركة اّر-جي-بي @2024

source: Made in Aman
ar: صنع في أمان
